---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPSection.Dispose
source: html/d1b33289-a3fe-033a-baa8-93d28244ef39.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSection.Dispose Method

Releases all resources used by the MEPSection

## Syntax (C#)
```csharp
public void Dispose()
```